app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hi"], ["created_at", "2021-09-29 17:12:01.580093"], ["updated_at", "2021-09-29 17:12:01.580093"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])